/*
Наименьшая и наибольшая цифра
Организовать ввод натурального числа с клавиатуры. Программа должна определить наименьшую и наибольшую цифры, которые входят в состав данного натурального числа. 

Данные на входе:	Целое неотрицательное число 
Данные на выходе:	Две цифры через пробел. Сначала наименьшая цифра числа, затем наибольшая. 

Пример №1
Данные на входе:	15 
Данные на выходе:	1 5 

Пример №2
Данные на входе:	2457 
Данные на выходе:	2 7 

Пример №3
Данные на входе:	22 
Данные на выходе:	2 2
*/
#include <stdio.h>
 
int main(void)
{
unsigned int a,min,max;
	printf("Enter number: ");
	scanf("%d", &a);
	max = 0;
	min = a;
	int num;
	while (a!=0)
	{
		num = a%10;
		if (max<num) max=num;
		if (min>num) min=num;
		a/=10;
						
	}
	printf("min = %d, max = %d\n  ",min,max);  
	return 0;
}
