/*
Точная степень двойки
Написать логическую рекурсивную функцию и используя ее определить является ли введенное натуральное число точной степенью двойки.
int is2pow(int n)
Данные на входе: 	Одно натуральное число. 
Данные на выходе: 	YES или NO 

Пример №1
Данные на входе: 	8 
Данные на выходе: 	YES 

Пример №2
Данные на входе: 	7 
Данные на выходе: 	NO 
*/


#include <stdio.h>

int is2pow(int n)
{
	if (!(n % 2))
		return is2pow(n/2);
	return  n == 1;
}


int main()
{
	int input;
	printf("Enter number:");
	scanf("%d", &input);
	printf("%s",is2pow(input)?"YES":"NO");
	return 0;
}

